USE Shorats;

INSERT _ProductGroup 
		VALUES 
		(1, 'Парфюмерия'),
		(2, 'Косметика'),
		(3, 'Бытовая химия')
		
INSERT _Product 
		VALUES 
		(1, 1, 'Парфюм', '5 лет'),
		(2, 2, 'Тушь для ресниц', '12 месяцев'),
		(3, 2, 'Шампунь для волос', '3 года'),
		(4, 3, 'Чистящее средство для душевой кабины', '2 года'),
		(5, 2, 'Спрей для тела', '3 года'),
		(6, 2, 'Блеск для губ', '2 года')

INSERT ProductRange 
		VALUES 
		(1, 3, 1, 2.32, 'группа C', 'с авансом в размере 50%'),
		(2, 6, 6, 3.54, 'группа Е', 'без предоплаты'),
		(3, 4, 4, 3.05, 'группа F', 'наличными в кассу предприятия'),
		(4, 2, 3, 3.54, 'группа Е', 'в полном объеме после подписания передаточного акта'),
		(5, 5, 2, 7.47, 'группа D', 'с авансом в размере 50%'),
		(6, 1, 5, 48.19, 'группа F', 'наличными в кассу предприятия')

INSERT _Bank 
		VALUES 
		(1, 'АСБ Беларусбанк', 'Минск'),
		(2, 'Абсолютбанк', 'Витебск'),
		(3, 'БелВЭБ', 'Гродно'),
		(4, 'Статусбанк', 'Могилев'),
		(5, 'Паритетбанк', 'Гомель'),
		(6, 'РРБ-Банк', 'Брест')

INSERT Suppliers 
		VALUES 
		(1, 'Garnier', 'ул. Базовая 5', '+375298741526', '8-017-5487512', 'f5vfwbd@gmail.com', 547821654832, 1452165349512057, 1, 2),
		(2, 'Ninel Parfum', 'ул. Свердлова 120', '+375299422016', '8-0162-5871546', 'ajvdstgswvq2c2v@gmail.com', 235841699102, 1452368502607802, 5, 3),
		(3, 'bk', 'ул. Чкалова  17', '+375295184549', '8-0232-4591628', 'fv3fc2j27eh@gmail.com', 102359781206, 1851264549600287, 4, 5),
		(4, 'Suprim ', 'ул. Нижненабережная 48', '+375292032659', '8-0222-9871210', 'ndbd4v3n2@gmail.com', 102365978134, 1032097545531980, 3, 4),
		(5, 'Dilis ', 'ул. Известковая 5', '+375294147456', '8-0152-8945425', 'sfavdv3n22@gmail.com', 230212872991, 1420365100526849, 6, 6),
		(6, 'Belita-Viteks', 'ул. Доватора  78', '+375297844886', '8-0212-6551012', 'bd3v3bnw3u@gmail.com', 103254988264, 1556003021360985, 2, 1)

INSERT Suply 
		VALUES 
		(1, 6, 6, 70, 'шт.', 6, '58 12.02.2022', '28.05.2022'),
		(2, 5, 1, 50, 'шт.', 7, '74 01.03.2022', '28.03.2022'),
		(3, 4, 4, 50, 'шт.', 6, '81 22.03.2022', '29.04.2022'),
		(4, 1, 3, 40, 'шт.', 7, '106 02.06.2022', '24.07.2022'),
		(5, 3, 2, 45, 'шт.', 6, '69 29.02.2022', '20.04.2022'),
		(6, 2, 5, 35, 'шт.', 7, '101 27.04.2022', '30.05.2022')

INSERT Reservation 
		VALUES 
		(1, 5, '69.6', 30, 'шт.', '12.03.2022', '24.03.2022', '26.03.2022', 'целостность товара', '010120210002'),
		(2, 2, '88.5', 25, 'шт.', '27.03.2022', '02.04.2022', '02.04.2022', 'целостность товара', '017120590002'),
		(3, 3, '92.8', 40, 'шт.', '02.03.2022', '15.03.2022', '16.03.2022', 'целостность товара', '0107802107262'),
		(4, 1, '481.9', 10, 'шт.', '21.03.2022', '14.04.2022', '14.04.2022', 'целостность товара', '010121260002'),
		(5, 4, '112.85', 37, 'шт.', '09.05.2022', '30.05.2022', '06.06.2022', 'целостность товара', '019750210002'),
		(6, 6, '53.1', 15, 'шт.', '17.05.2022', '29.05.2022', '29.05.2022', 'целостность товара', '010120310202')

INSERT Clients 
		VALUES 
		(1, 'Евроопт', 'ул. Рошкина 78', '+375294887472', '8-017-2541210', 'hgvv2h2vne@gmail.com', 1, 2),
		(2, 'Корона', 'ул. Зыгина 12', '+375296941215', '8-0232-2101516', 'kej73g3rg3@gmail.com', 4, 5),
		(3, 'Остров чистоты и вкуса', 'ул. Машерова 13', '+375294889692', '8-0162-4789251', 'jbdfjd7wge2@gmail.com', 6, 4),
		(4, 'Гиппо', 'ул. Мира 3', '+375295890203', '8-0212-3641920', 'jchydyqyeg2gg3@gmail.com', 3, 1),
		(5, 'Мила', 'ул. Комсомольская 126', '+375293644742', '8-0152-2098451', 'jfjeg3yy33v@gmail.com', 5, 3),
		(6, 'Green', 'ул. Чкарова 39', '+375295200697', '8-0222-8451697', 'hjw3hrhg3@gmail.com', 2, 6)

INSERT into register 
		(login_user, password_user) values ('admin', 'admin')